const mainArr = [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
const positiveNumber = mainArr.filter((el)  => el >= 0);
const negativeNumber = mainArr.filter((el)  => el < 0);
const oddNumber = positiveNumber.filter((el) => el % 2 !== 0);
const evenNumber = positiveNumber.filter((el) => el % 2 === 0);

console.log(`1) Знайти суму та кількість позитивних елементів: 
    сумма = ${positiveNumber.reduce((sum, el) => sum + el)}; 
    кількість = ${positiveNumber.length}.`);
console.log(`2) Знайти мінімальний елемент масиву та його порядковий номер: 
    мінімальний елемент = ${Math.min(... mainArr)};
    порядковий номер = ${(mainArr.indexOf(Math.min(... mainArr))) + 1 }.`); // не индекс! а именно порядковый номер.
console.log(`3) Знайти максимальний елемент масиву та його порядковий номер: 
    максимальний елемент = ${Math.max(... mainArr)};
    порядковий номер = ${(mainArr.indexOf(Math.max(... mainArr))) + 1 }.`); // не индекс! а именно порядковый номер.
console.log(`4) Визначити кількість негативних елементів: 
    кількість = ${negativeNumber.length}.`);
console.log(`5) Знайти кількість непарних позитивних елементів:
    кількість = ${oddNumber.length}.`);
console.log(`6) Знайти кількість парних позитивних елементів: 
    кількість = ${evenNumber.length}.`);
console.log(`7) Знайти суму парних позитивних елементів: 
    сума = ${evenNumber.reduce((sum, el) => sum + el)}.`);
console.log(`8) Знайти суму непарних позитивних елементів: 
    сума = ${oddNumber.reduce((sum, el) => sum + el)}.`);
console.log(`9) Знайти добуток позитивних елементів: 
    добуток = ${positiveNumber.reduce((sum, el) => sum * el)}.`);
console.log(`10) Знайти найбільший серед елементів масиву, остальні обнулити: 
    обнулені всі окрім найбільшого = ${mainArr.map(el => (el !== Math.max(... mainArr)) ? 0 : el)}.`);










/*
Дан масив [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]
   1 Знайти суму та кількість позитивних елементів.
   2 Знайти мінімальний елемент масиву та його порядковий номер.
   3 Знайти максимальний елемент масиву та його порядковий номер.
   4 Визначити кількість негативних елементів.
   5 Знайти кількість непарних позитивних елементів.
   6 Знайти кількість парних позитивних елементів.
   7 Знайти суму парних позитивних елементів.
   8 Знайти суму непарних позитивних елементів.
   9 Знайти добуток позитивних елементів.
   10 Знайти найбільший серед елементів масиву, остальні обнулити.
    */